{"format": "graph-model", "generatedBy": "2.0.0-alpha0", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"node": [{"name": "dense_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "120"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "120"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_2/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1056"}, {"size": "512"}]}}}}}, {"name": "global_average_pooling2d_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "NASNet/concatenate_7/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "NASNet/separable_conv_2_bn_normal_left5_12/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "NASNet/separable_conv_2_normal_left5_12/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "176"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_normal_left5_12/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "176"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_normal_left5_12/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_normal_left5_12/separable_conv2d/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "176"}, {"size": "176"}]}}}}}, {"name": "separable_conv_1_normal_left5_12/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "176"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_bn_1_12/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_conv_1_12/Conv2D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1056"}, {"size": "176"}]}}}}}, {"name": "NASNet/separable_conv_2_bn_normal_left5_11/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_normal_left5_11/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "176"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_normal_left5_11/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "176"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_normal_left5_11/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_normal_left5_11/separable_conv2d/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "176"}, {"size": "176"}]}}}}}, {"name": "separable_conv_1_normal_left5_11/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "176"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_bn_1_11/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_conv_1_11/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1056"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_normal_left5_10/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "NASNet/separable_conv_2_normal_left5_10/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "176"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_normal_left5_10/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "176"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_normal_left5_10/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "NASNet/separable_conv_1_normal_left5_10/separable_conv2d/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "176"}, {"size": "176"}]}}}}}, {"name": "separable_conv_1_normal_left5_10/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "176"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_bn_1_10/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_conv_1_10/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1056"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_normal_left5_9/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_normal_left5_9/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "176"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_normal_left5_9/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "176"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_normal_left5_9/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_normal_left5_9/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "176"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_normal_left5_9/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "176"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_bn_1_9/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_conv_1_9/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "704"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_reduction_left4_reduce_8/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_reduction_left4_reduce_8/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "176"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_reduction_left4_reduce_8/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "176"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_reduction_left4_reduce_8/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_reduction_left4_reduce_8/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "176"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_reduction_left4_reduce_8/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "176"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_reduction_right1_reduce_8/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_reduction_right1_reduce_8/separable_conv2d/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "176"}, {"size": "176"}]}}}}}, {"name": "separable_conv_2_reduction_right1_reduce_8/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "176"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_reduction_right1_reduce_8/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_reduction_right1_reduce_8/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "176"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_reduction_right1_reduce_8/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "176"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_pad_reduction_right2_reduce_8/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "NASNet/adjust_bn_reduce_8/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "NASNet/adjust_conv_projection_reduce_8/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "528"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_normal_left5_7/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_normal_left5_7/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "88"}, {"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_normal_left5_7/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "88"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_normal_left5_7/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "88"}]}}}}}, {"name": "NASNet/separable_conv_1_normal_left5_7/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "88"}, {"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_normal_left5_7/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "88"}, {"size": "1"}]}}}}}, {"name": "NASNet/normal_bn_1_7/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_conv_1_7/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "528"}, {"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_normal_left5_6/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "88"}]}}}}}, {"name": "NASNet/separable_conv_2_normal_left5_6/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "88"}, {"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_normal_left5_6/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "88"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_normal_left5_6/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "88"}]}}}}}, {"name": "NASNet/separable_conv_1_normal_left5_6/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "88"}, {"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_normal_left5_6/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "88"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_bn_1_6/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_conv_1_6/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "528"}, {"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_normal_left5_5/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_normal_left5_5/separable_conv2d/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "88"}, {"size": "88"}]}}}}}, {"name": "separable_conv_2_normal_left5_5/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "88"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_normal_left5_5/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_normal_left5_5/separable_conv2d/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "88"}, {"size": "88"}]}}}}}, {"name": "separable_conv_1_normal_left5_5/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "88"}, {"size": "1"}]}}}}}, {"name": "NASNet/normal_bn_1_5/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_conv_1_5/Conv2D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "352"}, {"size": "88"}]}}}}}, {"name": "NASNet/separable_conv_2_bn_reduction_left4_reduce_4/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "88"}]}}}}}, {"name": "NASNet/separable_conv_2_reduction_left4_reduce_4/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "88"}, {"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_reduction_left4_reduce_4/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "88"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_reduction_left4_reduce_4/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_reduction_left4_reduce_4/separable_conv2d/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "88"}, {"size": "88"}]}}}}}, {"name": "separable_conv_1_reduction_left4_reduce_4/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "88"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_reduction_right1_reduce_4/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "88"}]}}}}}, {"name": "NASNet/separable_conv_2_reduction_right1_reduce_4/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "88"}, {"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_reduction_right1_reduce_4/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "88"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_reduction_right1_reduce_4/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_reduction_right1_reduce_4/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "88"}, {"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_reduction_right1_reduce_4/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "88"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/adjust_bn_reduce_4/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "88"}]}}}}}, {"name": "NASNet/adjust_conv_projection_reduce_4/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "264"}, {"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_normal_left5_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}}}, {"name": "NASNet/separable_conv_2_normal_left5_2/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "44"}, {"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_normal_left5_2/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "44"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_normal_left5_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}}}, {"name": "NASNet/separable_conv_1_normal_left5_2/separable_conv2d/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "44"}, {"size": "44"}]}}}}}, {"name": "separable_conv_1_normal_left5_2/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "44"}, {"size": "1"}]}}}}}, {"name": "NASNet/normal_bn_1_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}}}, {"name": "NASNet/normal_conv_1_2/Conv2D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "264"}, {"size": "44"}]}}}}}, {"name": "NASNet/separable_conv_2_bn_normal_left5_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}}}, {"name": "NASNet/separable_conv_2_normal_left5_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "44"}, {"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_normal_left5_1/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "44"}, {"size": "1"}]}}}}}, {"name": "NASNet/separable_conv_1_bn_normal_left5_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_normal_left5_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "44"}, {"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_normal_left5_1/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "44"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_bn_1_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_conv_1_1/Conv2D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "264"}, {"size": "44"}]}}}}}, {"name": "NASNet/separable_conv_2_bn_normal_left5_0/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_normal_left5_0/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "44"}, {"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_normal_left5_0/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "44"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_normal_left5_0/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_normal_left5_0/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "44"}, {"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_normal_left5_0/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "44"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_bn_1_0/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/normal_conv_1_0/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "88"}, {"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_reduction_left4_stem_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "22"}]}}}}}, {"name": "NASNet/separable_conv_2_reduction_left4_stem_2/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "22"}, {"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_reduction_left4_stem_2/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "22"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_reduction_left4_stem_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_reduction_left4_stem_2/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "22"}, {"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_reduction_left4_stem_2/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "22"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_reduction_right1_stem_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_reduction_right1_stem_2/separable_conv2d/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "22"}, {"size": "22"}]}}}}}, {"name": "separable_conv_2_reduction_right1_stem_2/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "22"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_reduction_right1_stem_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_reduction_right1_stem_2/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "22"}, {"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_reduction_right1_stem_2/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "22"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/adjust_bn_stem_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "adjust_conv_2_stem_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/cropping2d_7/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "NASNet/cropping2d_7/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "NASNet/cropping2d_7/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "NASNet/zero_padding2d_7/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "NASNet/stem_bn1/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/stem_conv1/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}}, {"name": "adjust_conv_1_stem_2/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "11"}]}}}}}, {"name": "NASNet/adjust_bn_stem_2/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_reduction_left1_stem_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_reduction_left1_stem_2/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "22"}, {"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_reduction_left1_stem_2/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "22"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_reduction_left1_stem_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_reduction_left1_stem_2/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "22"}, {"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_reduction_left1_stem_2/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "22"}, {"size": "1"}]}}}}}, {"name": "NASNet/separable_conv_1_pad_reduction_right3_reduce_8/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "NASNet/reduction_bn_1_stem_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/reduction_conv_1_stem_2/Conv2D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "44"}, {"size": "22"}]}}}}}, {"name": "NASNet/separable_conv_2_bn_reduction_left4_stem_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_reduction_left4_stem_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "11"}, {"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_reduction_left4_stem_1/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "11"}, {"size": "1"}]}}}}}, {"name": "NASNet/separable_conv_1_bn_reduction_left4_stem_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}]}}}}}, {"name": "NASNet/separable_conv_1_reduction_left4_stem_1/separable_conv2d/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "11"}, {"size": "11"}]}}}}}, {"name": "separable_conv_1_reduction_left4_stem_1/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "11"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_reduction_right1_stem_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_reduction_right1_stem_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "11"}, {"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_reduction_right1_stem_1/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "11"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_reduction_right1_stem_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_reduction_right1_stem_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_reduction_right1_stem_1/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "32"}, {"size": "1"}]}}}}}, {"name": "NASNet/separable_conv_1_pad_reduction_right2_stem_1/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "NASNet/separable_conv_2_bn_reduction_left1_stem_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_reduction_left1_stem_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "11"}, {"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_reduction_left1_stem_1/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "11"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_reduction_left1_stem_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_reduction_left1_stem_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "11"}, {"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_reduction_left1_stem_1/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "11"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_pad_reduction_right3_stem_1/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "NASNet/reduction_bn_1_stem_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}]}}}}}, {"name": "NASNet/reduction_conv_1_stem_1/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/reduction_pad_1_stem_1/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "NASNet/separable_conv_2_bn_reduction_right2_stem_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_reduction_right2_stem_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "11"}, {"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_reduction_right2_stem_1/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "11"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_reduction_right2_stem_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_reduction_right2_stem_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_reduction_right2_stem_1/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_reduction_right3_stem_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_reduction_right3_stem_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "11"}, {"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_reduction_right3_stem_1/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "11"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_reduction_right3_stem_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_reduction_right3_stem_1/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_reduction_right3_stem_1/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_reduction_right2_stem_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "22"}]}}}}}, {"name": "NASNet/separable_conv_2_reduction_right2_stem_2/separable_conv2d/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "22"}, {"size": "22"}]}}}}}, {"name": "separable_conv_2_reduction_right2_stem_2/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "22"}, {"size": "1"}]}}}}}, {"name": "NASNet/separable_conv_1_bn_reduction_right2_stem_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "22"}]}}}}}, {"name": "NASNet/separable_conv_1_reduction_right2_stem_2/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "22"}, {"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_1_reduction_right2_stem_2/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "22"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_reduction_right3_stem_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "22"}]}}}}}, {"name": "NASNet/separable_conv_2_reduction_right3_stem_2/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "22"}, {"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_reduction_right3_stem_2/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "22"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_reduction_right3_stem_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_reduction_right3_stem_2/separable_conv2d/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "22"}, {"size": "22"}]}}}}}, {"name": "separable_conv_1_reduction_right3_stem_2/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "22"}, {"size": "1"}]}}}}}, {"name": "NASNet/adjust_bn_0/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "adjust_conv_2_0/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "44"}, {"size": "22"}]}}}}}, {"name": "adjust_conv_1_0/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "44"}, {"size": "22"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/adjust_bn_0/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_normal_right2_0/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_normal_right2_0/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "44"}, {"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "separable_conv_2_normal_right2_0/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "44"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_1_bn_normal_right2_0/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}}}, {"name": "NASNet/separable_conv_1_normal_right2_0/separable_conv2d/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "44"}, {"size": "44"}]}}}}}, {"name": "separable_conv_1_normal_right2_0/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "44"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_bn_normal_left2_0/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NASNet/separable_conv_2_normal_left2_0/separable_conv2d/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "44"}, {"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, 